[
  {
    "id": "44757f109dbb789d8a4be928d44cc3ffdc3f08c60f02b4fcee998f4e3c857b72",
    "title": "stablecoins risk - embedded iframe test ",
    "content": "Risks landscape for stablecoins\n\n\n\n<iframe src=\"https://docs.google.com/document/d/e/2PACX-1vQr8viInBKRymuJljVWxDB9YiwkjlbsRI4MclA24PvsOesQTV1_Wl4o9xeW4BiurSxR8GXoC1b_rWTt/pub?embedded=true\"></iframe>\n\n\n\n\n\n\n\nhttps://docs.google.com/document/d/e/2PACX-1vQr8viInBKRymuJljVWxDB9YiwkjlbsRI4MclA24PvsOesQTV1_Wl4o9xeW4BiurSxR8GXoC1b_rWTt/pub",
    "date": "2024-10-12T21:54:08.537Z"
  },
  {
    "id": "05be383d7d2c038a011d3be50dcf935058b44d8610142fe569decacb0c566ed4",
    "title": "Stablecoin problems ",
    "content": "A strong payments foundation is required to realize onchain capital markets. State of the art stablecoins experience the following problems: \n\n1. Nonexistent yield distribution\n2. Slippage\n3. Liquidity fragmentation\n4. USDC, systemic centralization\n5. Inflexible collateral systems\n6. Over-collateralization or liquidation risk\n7. Impermanent loss for LPs\n8. Holdings transparency\n9. Counterparty risk for underlying reserves\n10. Depegging\n\n\nThe stability of stablecoins is intrinsically linked to the design of their stabilization mechanisms. Crypto's inherent programmability can reliably + entirely prevent the following:\n\n<strong>Stablecoin USDC breaks dollar peg after firm reveals it has $3.3 billion in SVB exposure</strong>\nhttps://www.cnbc.com/2023/03/11/stablecoin-usdc-breaks-dollar-peg-after-firm-reveals-it-has-3point3-billion-in-svb-exposure.html\n\n<strong>Tether’s USDT Stablecoin Depegs from US Dollar on Exchanges After Company Froze $435M</strong>\nhttps://cryptonews.com/news/tethers-usdt-stablecoin-depegs-from-us-dollar-on-exchanges-after-company-froze-435m/\n\n<strong>Tether & Bitfinex Fraud Settlement</strong>\nhttps://ag.ny.gov/sites/default/files/2021.02.17_-_settlement_agreement_-_execution_version.b-t_signed-c2_oag_signed.pdf\n\n\n\nDEPEGGING PROBLEM RESEARCH\n\n\"developing and maintaining high-quality stablecoins is a key challenge in crypto finance\"\n\nhttps://www.spglobal.com/content/dam/spglobal/corporate/en/images/general/special-editorial/stablecoinsadeepdiveintovaluationanddepegging.pdf\n\n\n\"simpler tokenized fund designs outperform more complex stablecoin structures in reducing volatility\"\n\nhttps://papers.ssrn.com/sol3/papers.cfm?abstract_id=4700764",
    "date": "2024-10-12T20:00:18.079Z"
  },
  {
    "id": "ad5a87cf985f9ffee76f5886915b767957ff0e28b60ada891e058b185a770013",
    "title": "Intro to Calculus",
    "content": "<strong>Everlasting Options</strong>\n\nEverlasting options are the equivalent of perpetual futures for options.\n\nEverlasting options work exactly the same way as perpetual futures, with one difference: the funding fee is calculated as the difference of the mark price and the current payoff of the option, so that the funding fee is (mark - payoff) instead of (mark - index).\n\n<i>Examples:</i> Consider the $3000 strike everlasting ETH put with funding paid once daily.\n\nIf ETH is currently trading at $2900, the current payoff of the put is $3000 - $2900 = $100. If the everlasting put is trading for $150 the instant before funding is paid, then the longs would have to pay the shorts mark - payoff = $150 - $100 = $50 per day.\n\nIf ETH is currently trading at $3100, above the strike of the everlasting put, then the put's payoff is $0. If the everlasting put is trading for $50 the instant before funding is paid, then the longs would have to pay the shorts mark - payoff = $50 - $0 = $50 per day.\n\nNotice that the payoff of a $0 strike ETH call is just the price of ETH — in other words, payoff = index. This means the $0 strike call is equivalent to an ETH future. Appropriately, the daily funding fee for the $0 strike everlasting call is mark - payoff = mark - index, the same as the funding fee for a perpetual future.\n\n\n\n\n<strong>II. Contract for Difference (CFD)</strong>\n\nA CFD is a derivative allowing traders to speculate on asset price movements without owning the asset. Profits or losses are determined by the difference between the entry and exit prices. No funding fees; rather, traders pay the spread or a financing fee if holding overnight.\n\n\n\n\n<strong>III. Perpetual Futures</strong>\n\nSimplified a bit, perps work as follows: every day, those who are long the perp (have bought it) must pay a funding fee to those who are short the perp (have sold it).\n\n<i>Examples:</i>\n\nIf the ETH perp is trading at $3100 while the price of ETH is at $3000, the longs must pay the shorts mark - index = $3100 - $3000 = $100 per day.\n\nIf the ETH perp is trading for $2900 while the price of ETH is at $3000, mark - index = $2900 - $3000 = -$100, meaning the shorts must pay the longs $100 per day.\n\n\n\n\n\nparadigm doesn't miss\nhttps://www.paradigm.xyz/2021/05/everlasting-options",
    "date": "2024-10-11T19:34:01.701Z"
  },
  {
    "id": "6bf23196b7c2f2e0e499fdb79b724f0f4ce37536d78f77d25a572e69f028151d",
    "title": "Alts CLOB",
    "content": "I. Closed-end fund NAV exits\n\n- quote underlying at NAV, tokenize on execution\n\n\nII. Gradual Dutch Auction (GDA) - a mechanism that enables efficient sales of assets that do not have liquid markets\n\nGDAs work by breaking up a sale into a sequence of Dutch auctions—a type of auction that start with a high asking price that is gradually lowered until a buyer makes a bid. GDAs allow you to purchase multiple of these auctions at once in a gas-efficient manner.\n\nMore info: https://www.paradigm.xyz/2022/04/gda\n\n\nIII. Prediction + perpetual markets",
    "date": "2024-10-11T19:18:39.998Z"
  },
  {
    "id": "a128d7fc00d0b50013616f6523595e462b6f61226b0e0beb14ba71b376e303a4",
    "title": "Collateral & Repurchase Agreements",
    "content": "<strong>Collateralization is a spectrum that balances risk, liquidity, and capital efficiency</strong>\n\nInstitutions use the repo market to obtain leverage for trading, similar to how crypto traders use crypto lending markets to fund profitable trades (this works in part because many traders experience significant capital gains, which blunts the capital impact of overcollateralization).\n\n\n1. Maturity mismatch necessarily leads to instability, which is why central banks and prudential regulation exist in the first place.\n\n2. The capital efficiency we get through <i>uncollateralized</i> bank lending is socially costly and operationally difficult to control.\n\n\n<strong>Repo Example</strong>\n\nWhen Alice and Bob agree to an overnight repo trade, Alice gives Bob $100 cash in exchange for $100 in treasuries. The next day, Bob pays back Alice the $100 plus some interest, and Alice returns to Bob his $100 in Treasuries.\n\n\n\nMore payments\n\nhttps://www.bis.org/statistics/payment_stats/commentary2402.pdf\n",
    "date": "2024-10-11T19:01:47.930Z"
  },
  {
    "id": "b72334d60ec95dd58e194c4c85ef17ab721b4cda832073de5441cb7c4535c0d7",
    "title": "Good payments sources + sizes from Paradigm",
    "content": "\n1. US repo market handles ~4 trillion USD in trading volume daily.\n2. Private credit has grown from almost nothing in 2008 to an $800 billion market today.\n\nhttps://www.paradigm.xyz/2024/05/the-edges-of-finance\n\nhttps://www.paradigm.xyz/2023/07/the-future-of-payments-includes-stablecoins\n\n\n\nXFT metrics:\n\nhttps://x-financial-technologies.replit.app/api/market-sizes\n\n\n\n\n",
    "date": "2024-10-11T18:55:10.062Z"
  },
  {
    "id": "847cb3f1957be52d4da56b4e95c4111abad1d38caab941e95d3a5d1568bb9106",
    "title": "Algorithmic CEF ",
    "content": "Use accumulating + rebasing tokens to manage NAV deviations \n\n\nDistribution, NAV decrease\n\n",
    "date": "2024-10-11T15:52:04.204Z"
  },
  {
    "id": "3aa477e74b4a77228d97a49c4b18561c28715db308c365375a762b93c9b24a50",
    "title": "Simple Multisig",
    "content": "<strong>Ethereum Auth</strong>\n\nAn Ethereum transaction is a payload including an eth transfer amount, a nonce, a destination, gas limit, gas price, and a data payload. The sender signs (a hash of) the whole transaction using their private key, and is identified by the public key that can be obtained from the published signature. The “from” address is found by a hash of the signature’s public key. \n\nA smart contract transaction uses the data payload to include operations within the smart contract’s on-chain storage. The smart contract itself, which is created as a payload of a contract-creation transaction, can include authorization rules stating that only certain addresses can do certain operations on the smart contract. One can create a multisig contract by having smart contract operations for proposing a transaction, and approving the transaction, and limiting the addresses who can call those functions to only a small set.\n\nThe simple multisig smart contract uses a third type of auth by doing on-contract authentication. In a simple multisig transaction all of the multiple signatures needed to approve a transaction are included in a single data payload in a single Ethereum “network transaction”. The data payload also includes the whole “smart contract transaction”, like a submessage of the transaction. The smart contract has its own explicit protocol for how to verify those signatures, using a hash of the submessage as the contents that are being authorized by the multisig signers. That submessage can represent the action of an Ethereum transaction, including moving Eth that’s being held by the multisig contract or doing an operation on another smart contract, such as moving ERC20 tokens held by the multisig contract.\n\nThe adage, “never roll your own crypto” applies here since we have the opportunity to use any protocol as the signing scheme within the multisig smart contract. Luckily, the Ethereum community has had a well-received standard proposal for smart contract signing schemes in EIP712 for a few years now. The principle of the scheme is to use the same hashing algorithm and data that the ethereum network uses, and to also hash in context data about the function being called and the contract address itself to avoid unintended re-usability of submessage signatures.\n\nSubmessage signatures using the EIP712 standard offer other benefits, such as the ability to have one address pay the gas fee for another address, which is a feature that Paxos has implemented in it’s token smart contracts. \n\nhttps://paxos.com/2021/03/23/simple-multisig-how-it-works-and-why-its-awesome/\n\nhttps://github.com/amr080/simple-multisig\n\n\n<strong>What is a nonce?</strong>\n\nA scalar value equal to the number of transactions sent from this address. The nonce must be set to the next value for every new Ethereum network transaction. The nonce protects against the same transaction being sent twice.\n\n\n\n\n\n",
    "date": "2024-10-11T12:32:21.631Z"
  },
  {
    "id": "73c65c3bb622190642b18067cc05c1a434c029748dd990259094a6c848cbd9ad",
    "title": "Source code for popular stablecoins",
    "content": "<strong>Token Types</strong>\n\n1. Underlying: payment vs. asset\n2. Price: rebasing vs. accumulating\n\n\n\n\n\n<strong>Circle, USDC</strong>\nhttps://github.com/circlefin/stablecoin-evm\n\n\n<strong>Ondo, USDY</strong>\nhttps://github.com/ondoprotocol/usdy\n\n\n<strong>Ondo, OUSG</strong>\nhttps://github.com/amr080/ondo-tokenized-funds\n\n\n<strong>Agora Dollar, AUSD</strong>\nhttps://github.com/agora-finance/agora-dollar-evm\n\n1. CBDC\n\n<strong>DS Protocol, BUIDL</strong>\nhttps://drive.google.com/file/d/1HENb12Ryf_TsCneSDps90HQHimjQ6TiY/view?usp=sharing\n\n\n<strong>Backed</strong>\nhttps://github.com/backed-fi/backed-token-contract\n\n\n<strong>Dinari, USD+</strong>\nhttps://github.com/dinaricrypto/usdplus-contracts\n\n1. Payments token\n\n\n<strong>Dinari, dShares</strong>\nhttps://github.com/dinaricrypto/sbt-contracts\n\n1. Asset token\n\n\n<strong>Mountain, USDM</strong>\nhttps://github.com/mountainprotocol/tokens\n\n\n<strong>Superstate, USTB</strong>\nhttps://github.com/superstateinc/ustb\n\n\n<strong>Paxos, PYUSD</strong>\nhttps://github.com/paxosglobal/pyusd-contract\n\n\"PayPal USD\"\n\n\n<strong>Paxos, BUSD</strong>\nhttps://github.com/paxosglobal/busd-contract\n\n\n<strong>Paxos, USDP</strong>\nhttps://github.com/paxosglobal/usdp-contracts\n\n1. Rebasing: USDP\n2. Accumulating: wUSDP\n\n\n<strong>Paxos, USDL</strong>\nhttps://github.com/paxosglobal/ybs-contract\n\n1. Paxos International Yield Bearing Stablecoin, Lift Dollar (USDL)\n2. Rebasing + accumulating token types\n\n\n<strong>Paxos, PAXG</strong>\nhttps://github.com/paxosglobal/paxos-gold-contract\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n",
    "date": "2024-10-11T12:29:17.721Z"
  },
  {
    "id": "6c131b748a87468e0a888c26e61224f6ea21c5dd24c65f1257508a7be96d4456",
    "title": "usdx fund structure idea pt 3",
    "content": "Closed-end fund NAV = supply of rUSDX\n\n“real-time NAV”\n\n\nNAV = $100,000 -> rUSDX = 100,000\n\n\n- Enables exits at NAV 100% of time (??) \n- basket of assets redemption ? \n- rUSDX for USD or US treasuries (fund holdings) basket? \n",
    "date": "2024-10-11T08:34:45.672Z"
  },
  {
    "id": "9b1e757a840a64f4172724a9ae4614d70cf75f2e4a455f7c05933b89eac673a7",
    "title": "usdx structure pt 2",
    "content": "USDX, accumulating \n- represent shares of CEF\n- act as supply floor \n- NAV increase reflected in token price\n\n\nrUSDX, rebasing \n- used for distributions \n- 1 rUSDX = 1 USD\n- variable supply\n\n\n\nUSDX + rUSDX = Market Supply\n\n\nUSDX = AUM of fund\nrUSDX technically wouldn’t be under fund\n\n\n\n",
    "date": "2024-10-11T08:26:36.574Z"
  },
  {
    "id": "ed1ae8b6509d6848daae2c625a6330a20ee49b6a144ea0a32eca5ef263d8907a",
    "title": "usdx structure idea",
    "content": "Closed-end fund (ie supply floor)\nDaily distributions of rUSDX\n\n\n\nCEF with daily distributions?",
    "date": "2024-10-11T07:58:37.897Z"
  },
  {
    "id": "c5b5cb189848a34863c860b7fafb5ec7bb5ae0d071cb8fe49db21f412e9d5feb",
    "title": "Visa, DB, Circle Failure",
    "content": "Stablecoin USDC breaks dollar peg after firm reveals it has $3.3 billion in SVB exposure\nhttps://www.cnbc.com/2023/03/11/stablecoin-usdc-breaks-dollar-peg-after-firm-reveals-it-has-3point3-billion-in-svb-exposure.html\n\n\nThe Crypto Phenomenon: Consumer Attitudes & Usage\nhttps://usa.visa.com/dam/VCOM/regional/na/us/Solutions/documents/the-crypto-phenomenon-technical-paper.pdf\n\n\nStablecoins: DeFi, Libra and beyond\nhttps://www.dbresearch.com/PROD/RPS_EN-PROD/PROD0000000000522496/Stablecoins%3A_DeFi%2C_Libra_and_beyond.pdf\n\n\nBluechip Assessment: USDC\nhttps://assets.ctfassets.net/0x04pt0ewi4n/6jNviCmdzdRUid1gjKnQHL/e12e4812a510f41a65c1ed9cab73bd51/Bluechip_Assessment_-_USD_Coin__USDC_.docx.pdf",
    "date": "2024-10-11T05:33:06.884Z"
  },
  {
    "id": "61028494f5acd5041b77a03b234959735053fb40d740972fb1d5996dca4b182d",
    "title": "How does USDC work + problems",
    "content": "USDC = Circle Reserve Fund (USDXX) = SEC-registered 2a-7 government money market fund\n\n\nProblems\n\n1. Counterparty risk\n2. Inflation\n3. Transparency (this makes zero sense)\n\n\nUSDC is issued by Circle on a 1:1 basis in exchange for US Dollars. Circle manages these reserves, which it holds in traditional financial institutions (such as banks). The majority of the USDC reserve of these dollars is held in the Circle Reserve Fund (USDXX), an SEC-registered 2a-7 government money market fund. This Fund, according to Circle, “can contain cash, short-dated US Treasuries, and overnight US Treasury repurchase agreements with leading global banks.” Then, when USDC tokens are sold back, Circle pays the user from the reserves and handles the destruction of the original USDC to avoid inflation. Of course, there’s a bit more to it than that though, so let’s explore how USDC stays pegged to USD.\n\n\n<strong>Problem:</strong> Counterparty Risk\n\nCircle stores its reserves for both USDC and EURC in traditional financial institutions, i.e. banks. This introduces counterparty risk. Even if Circle manages the assets effectively, you’re also relying on the banks it uses to manage the reserves appropriately. If a bank containing too much of USDC’s reserves fails, it would diminish USDC’s liquid backing. This causes stablecoins to depeg. Unfortunately, that’s exactly what happened in March 2023: three US banks, Silicon Valley Bank (SVB), Signature Bank, and Silvergate Bank failed. Since Circle trusted SVB with $ 3.3 billion in cash reserves and relied on Signature and Silvergate for other services, USDC depegged by 13%. It also impacted fellow stablecoin DAI, as almost half of all DAI is backed by USDC. Fortunately, both coins recovered their pegs after the Federal Reserve agreed to support the banks’ creditors.\n\n\n<strong>Problem:</strong> Vulnerable to Price Fluctuations of the United States Dollar\n\nUSDC is pegged to the value of the United States dollar. This means the stablecoin is subject to the greenback’s price inflation. In short, USDC’s purchasing power depends on the U.S. dollar’s strength.  If USD loses its value, so does USDC. However, this is true for all stablecoins pegged to the dollar: not just USDC.\n\n\n<strong>Problem:</strong> Transparency (????)\n\nThe reserve backing of USDC comprises a mix of assets, the full details of which are not completely disclosed by Circle and Coinbase. Although they follow US regulations, it’s understandable that you may want to know the full details of how they are backing your assets. If the reserves aren’t managed properly, you could end up losing your funds.\n\nFor example, among these assets, USDC reserves include USD-denominated Treasury Bonds. While being low-risk investments, these are not instantly convertible to cash. That means if everyone decided to redeem their USDC for USD, it may cause USDC some liquidity issues.\n\nThat said, Circle holds USDC reserves in legally regulated financial institutions that are subject to monthly attestations. That means the reserves are audited, and you can likely trust that Circle will not decide to run away with all of your valuable assets: even though they could. Plus, since it’s backed by a majority of liquid cash and cash equivalents, it should have the liquidity to cover every asset in circulation. Plus, Circle publishes its reserves weekly.\n\n\n\nSource\nhttps://www.ledger.com/academy/what-is-usd-coin-usdc",
    "date": "2024-10-11T05:28:36.105Z"
  },
  {
    "id": "761f137fd0f90fe5c4ccb60d50563fecb5569d54b63308f8ba99fb6f6501d61c",
    "title": "Visa + USDC Settlements Case Study",
    "content": "Utilizing USDC settlement from Visa enabled Crypto.com to:\n\n1. Reduce prefunding from eight days to four\n2. Reduce FX fees by 20 to 30 bps\n3. Focus on corporate strategy over day-to-day operations\n\n\nhttps://usa.visa.com/content/dam/VCOM/regional/na/us/Solutions/documents/visa-crypto.com-usdc-case-study.pdf",
    "date": "2024-10-11T05:12:18.445Z"
  },
  {
    "id": "254b7490b734fe55a9841fb3860e3c5270eec27a766958173fed394a6f6695c0",
    "title": "How XFT fund tokenization works",
    "content": "Tokenization converts ownership rights in an asset into a digital token on a blockchain. Almost any asset can be tokenized, from financial instruments like equities and bonds to tangible assets such as real estate and precious metals.\n\n<strong>XFT Funds</strong>\n\nInvestors in XFT I LP can contribute stablecoins (or fiat) and will receive tokens representing their ownership in the fund. Investors can transfer these tokens between each other to effect changes in fund ownership. Investors can also use smart contracts to facilitate their financial arrangements such as by engaging in lending and trading activities with each other. The tokens themselves have transfer restrictions that will ensure they do not end up in the hands of anyone not appropriately qualified as an investor in the fund. Smart contracts that investors wish to use will also need to be approved by the fund through a compliance review to make sure they are not being used to subvert these transfer restrictions. X Financial Technologies Inc. will manage the tokenization as a technology services provider.",
    "date": "2024-10-11T01:22:00.807Z"
  },
  {
    "id": "3b552ed317c235a581abef1142fdc35b41ec825e0147089e6d01e5add5c02e1c",
    "title": "Why tokenized money market funds? Pt. 2",
    "content": "Improved cash utilization, liquidity risk reduction, instant settlement, 24/7 minting and redeeming\n\n\n<strong>Investors</strong>\n\n1. Yield on idle cash balances\n2. Low minimum investment\n3. Instant mint and redemption 24/7/365\n4. Frictionless collateral mobility\n\n\n<strong>Fund Managers</strong>\n\n1. Increased AUM\n2. Increases daily/weekly liquid assets\n3. Reduced funding + cash flow volatility\n4. Greater counterparty diversification\n5. Blockchain transparency\n6. Streamlined data and information management\n7. Automated back office workflows\n8. Outflow + redemption pressure reduction\n\n\n<strong>Financial Markets</strong>\n\n1. Demand increase for US Treasuries\n2. Fast, low-cost international payments\n3. Yielding self-custody\n\n\n\n",
    "date": "2024-10-11T00:56:36.230Z"
  },
  {
    "id": "6a0a648be620787cf25874760033cd25cb8f0bbc1b0833e4cfb71d7faebfcd06",
    "title": "Why tokenized money market funds?",
    "content": "Money Market Funds (MMFs) become more stable if investors can use their MMF shares directly as collateral, instead of selling them for cash. This reduces pressure on MMFs during market stress.\n\n\n<strong>Traditional:</strong> Investor sells MMF shares to get cash for margin call, causing fund outflows.\n<strong>Tokenized:</strong> Investor uses MMF shares/tokens directly as collateral, avoiding sale and fund outflows.\n\n\n<strong>Tokenized Money Market Fund:</strong>\n\n1. Investor buys tokenized MMF shares\n2. Shares held digitally in investor's wallet\n3. Investor can use tokens as collateral without selling\n4. Yield accrues to tokens (via price increase or rebasing)\n5. Investor sells or redeems tokens when needed\n\n<strong>Traditional Money Market Fund:</strong>\n\n1. Investor purchases MMF shares\n2. Shares held in brokerage account\n3. To use as collateral, investor must sell shares for cash\n4. Yield typically distributed or reinvested\n5. Investor redeems shares for cash when needed\n\n\nUSDX is NOT a tokenized money market fund - it is a tokenized US treasuries fund for institutional cash management and yield. Investors can gain exposure to MMFs via USDX as over 99.5% of USDX’s assets are currently invested in the Franklin Onchain U.S. Government Money Fund (FOBXX).\n",
    "date": "2024-10-11T00:45:05.456Z"
  },
  {
    "id": "2b7fd242b89bc693af9261bdbc2258980d37a72ee72bb59384038a90eb2248a3",
    "title": "USDX Distributions",
    "content": "USDX is a tokenized US treasuries fund for institutional cash management and yield. USDX is available in two versions, an accumulating token (USDX) and a rebasing token (rUSDX). While both versions pay out yield upon redemption and accrue yield daily, the manner in which the accrual is represented differs.\n\n\n<strong>I. USDX -> Accumulating</strong>\n\nFor USDX, the accruing yield gets ‘accumulated’ into the token price. As the underlying investments accrue yield daily, we recognize this yield by increasing the Net Asset Value (NAV) of the underlying Fund, thereby increasing the NAV per USDX token. \n\nUSDX is best suited for buy-and-hold cash management (some custodians only support accumulating tokens) and collateral use in smart contracts.\n\n\n<strong>II. rUSDX -> Rebasing</strong>\n\nrUSDX, on the other hand, is intended to maintain a price of $1.00 per token, with the accruing yield represented by the division of rUSDX tokens into more tokens via rebasing. 1 rUSDX = 1 USD.\n\nrUSDX is best suited for yield-bearing means of settlement or exchange.\n\n\n<strong>III. Distributions Example</strong>\n\nAs an example, let’s say you held 1 USDX token worth $100 and 100 rUSDX tokens worth $1.00 each. The next day the NAV per USDX token increased to $101 per token. After the price update and rebasing, your holdings of both rUSDX and USDX would be worth $101.00 each ($202.00 in total). You would still have a balance of 1 USDX token worth $101.00. However, due to the rebasing nature of rUSDX tokens, you would now hold 101 rUSDX tokens worth $1.00 per token.\n\n\n1. XFT calculates daily yield from fund investments\n2. XFT prepares yield distribution data per token holder\n3. XFT initiates distribution via USDXManager Contract\n4. USDXManager Contract calls rebase function or updates reference price\n5. USDX Token Contract updates token balances (rebasing) or token price (accumulating)\n6. Token holders' wallets reflect increased balances or token value\n7. Notifications sent to token holders about yield distribution\n",
    "date": "2024-10-11T00:39:10.114Z"
  },
  {
    "id": "0d3bb73d69e176b0d36c6f210c2241047d8599f1de2dfd370c593e6cbd879323",
    "title": "September 2008 Timeline",
    "content": "9/7 Fannie Mae and Freddie Mac placed in conservatorship\n9/10 Korean Development Bank ends investment talks with Lehman Brothers.\n9/12 Lehman considers asset sales\n9/12 Moody's and S&P downgrade Washington Mutual\n9/14 AIG capital injection announced\n9/14 Bank of America agrees to buy Merrill Lynch\n9/15 Lehman files for bankruptcy\n9/16 Reserve Primary Fund breaks the buck\n9/17 Federal Reserve lends to AIG for 79.9% company ownership\n9/17 Barclays buys Lehman's North American operations\n9/19 AMLF announces Treasury guarantees $1 NAV\n9/19 SEC issues temporary ban on short selling financial issues\n9/21 Goldman Sachs and Morgan Stanley convert to bank holding company status\n9/24 Central banks coordinate currency swap facility\n9/25 Ireland becomes first Eurozone country to announce recession\n9/26 JP Morgan Chase purchases Washington Mutual\n9/28 Congress approves $700 billion financial rescue plan\n9/29 Citigroup purchases Wachovia assets\n9/29 Global central banks inject credit market liquidity",
    "date": "2024-10-11T00:29:22.559Z"
  },
  {
    "id": "af8c19d75d060dc64c6a52a1a6245d942ccd96fb74e0e0f06297434b17f66bef",
    "title": "USDX: The Benefits of a Larger Money Market Fund",
    "content": "USDX is a tokenized US treasuries fund for institutional cash management and yield. We channel inflows from idle cash balances into money market funds. With USDX, your fund could benefit from:\n\n\n1. Enhanced counterparty diversification\n2. Outflow / redemption pressure reduction during market stress\n3. Increase in management fees\n4. Cash flow volatility reduction\n5. Increases daily/weekly liquid assets\n\n\nDuring a period of market stress, investors want to be able to use their cash. Thus, if invested in your MMF, they will likely redeem or liquidate positions for quick access to cash. The most commonly cited investor motivations include investor flights to quality; flights to liquidity; flights to transparency; and flights to performance during crisis periods.\n\n\n<strong>Case Study: The 2008 Money Market Crisis</strong>\n\n\nThe 2008 financial crisis triggered a money market crisis that included the failure of the original and oldest U.S. money fund, the $62 billion Reserve Primary Fund, which broke the one dollar net asset value mark (known as breaking the buck) in September 2008. An ensuing net redemption of prime money market funds[note 1] by both institutional and retail investors was counterbalanced by an inflow of funds to treasury/government money funds. Government action during the crisis included the formation of emergency measures designed to support and stabilize money markets. Subsequently, money market fund reform measures were instituted in 2010, with a second round of reforms added in 2014.\n\n\nhttps://www.bogleheads.org/wiki/The_2008_money_market_crisis\n\n\n\n\n",
    "date": "2024-10-11T00:28:28.639Z"
  },
  {
    "id": "db4df77368a45e433af41c778d694ae59df33158e096c9ff1189b1f6fddf0a9e",
    "title": "Proof of compliance - wallets",
    "content": "Smart wallets \n\n\nVerify two small transactions sent to wallet for user auth ",
    "date": "2024-10-03T08:52:06.030Z"
  },
  {
    "id": "6fc4d9b45beacf1158e3a0c3e86c204013580ea98e6c93efbf8943f1cec12d85",
    "title": "Stablecoins are investment management companies",
    "content": "Bitcoin = closed-end fund - underlying + technology",
    "date": "2024-10-03T08:46:37.741Z"
  },
  {
    "id": "fcbc6914e86540c5f40436ca8a44f64944341be22199294a245b706859242caf",
    "title": "Wallet authentication?",
    "content": "Send two small transactions -> creates 4 digit pin\n\nSimilar to state of the art ",
    "date": "2024-10-03T08:44:06.490Z"
  },
  {
    "id": "ca61e30511e5c706f28b26dd2b1d63ef8f3b8d2243557210686af6a92c88d6c1",
    "title": "Some standards",
    "content": "Work backwards from traditional finance into crypto.\n\nGold, mine\nBTC, mine\n\nStock, ownership\nToken, ownership\n\nIPO, capital raise\nICO, capital raise\n\nNYSE, exchange\nCoinbase, exchange",
    "date": "2024-09-27T03:32:49.515Z"
  },
  {
    "id": "c763dc289bde0ce6756fd5c64becf02453474db3729c4a0e116366ba6f1c62ef",
    "title": "Rebasing",
    "content": "ETF, rUSDX, open-end, variable supply, rebasing\nCEF, USDX, closed-end, fixed supply, accumulating",
    "date": "2024-09-25T01:50:28.952Z"
  },
  {
    "id": "f60809e59e27f4ef1b184ee0a165c56ebd68d5578d7f6a6af67dee4025a48fcb",
    "title": "How to make a mint",
    "content": "https://xcryptography.replit.app/",
    "date": "2024-09-25T01:30:28.507Z"
  },
  {
    "id": "f3b8b7d68326dd9d76f5dcad6fc066c0ed0b17e88be191d1277c31161a7b2625",
    "title": "Consensus 2024 Reflection",
    "content": "The Consensus 2024 conference hosted by @Coindesk offered many valuable learning opportunities for me in the DeFi space. During my stay at the @VaraNetwork Hacker House, I had the opportunity to learn from the Vara team- Adam and Luis about their impactful work. Furthermore, I met many like-minded students and found a broader technical community for the first time. Throughout the week, I spent most of my time listening to regulators and policymakers to further my understanding of the outsider’s perspective.\n\nThe insights I gained from the conference reinforced my belief that DeFi must cater to a new target audience—TradFi professionals. It was encouraging to see regulators beginning to appreciate the potential of tokenization and blockchain technology. This shift represents a critical inflection point, underscoring the need for the industry to bring more novel, user-friendly, solutions to the market. My favorite part of Consensus was experiencing the diverse perspectives and stages of crypto adoption on a global scale.\n\nAs a Duke University student, I am constantly inspired by our institution's dedication to fostering rigorous debate and pioneering innovations in DeFi. A prime example of this commitment is the Digital Assets at Duke (DA@D) conference, which I attended this past January. This event assembled industry leaders, regulatory experts, and researchers for two days filled with intensive discussions and educational opportunities. It promoted a culture of productive debate which has had a profound impact on my understanding of the industry.\n\nI would like to thank Gear Foundation and the broader Vara community for their support during my time at Consensus 2024. Staying at Vara’s Hacker House provided an invaluable learning experience and the opportunity to connect with key figures in the industry. Their support made my participation in the conference both enriching and impactful.",
    "date": "2024-06-25T00:15:46.247Z"
  },
  {
    "id": "9fa1d40dafb3f3c2cb21643f232e0f1d72ab7fb327578e211ef95bcb0df8b550",
    "title": "Tokenizing Real-World Assets with XFT Global Markets",
    "content": "<p>The biggest challenge in tokenizing real-world assets (\"RWAs\") is liquidity fragmentation.</p>\n        <p>For years, the RWA space was focused on tokenizing illiquid assets like newly originated private credit (e.g., uncollateralized loans to crypto market makers). While there may have been some value in providing direct access to these opportunities for stablecoin holders, the tokenization of the loans itself served little purpose. These assets are mostly buy-and-hold; they are too bespoke and hard to price for deep secondary markets to emerge, both on- and off-chain. Given the lack of secondary market liquidity, these assets don't make great collateral for on-chain lending, derivatives, or other protocols.</p>\n        <p>So, what is next? BCG predicts $16 trillion in diverse financial assets coming on-chain in the next decade. Many have been wondering which of those assets we will focus on beyond cash equivalents. In this post, we will unveil some of those plans. Specifically, rather than issuing tokens as distinct financial assets, XFT Global Markets will treat public blockchain tokens as a messaging system through which regulated broker-dealers and custodians will accept trade and settlement instructions.</p>\n        <p>For example, USDX tokens represent ownership in a new fund XFT set up, XFT I LP, which invests in the iShares Short Treasury Bond ETF (SHV). The problem with this approach is that it fragments liquidity. For example, while a USDX holder can redeem on any given day, they cannot sell USDX during market hours into bids on Nasdaq for SHV, since USDX and SHV are distinct financial assets. This fragmentation is made worse by the slow settlement times in traditional finance. If an investor wants to redeem USDX, ordinarily, we have to sell SHV shares, wait two days for cash to settle, convert USD to USDC, and then service the redemption. Of course, we work with market makers who are willing and able to buy USDX 24/7 at some price, knowing they can turn around and redeem for cash. We also offer T+0 redemptions at up to $100M. Still, these solutions come at some cost as they require having extra cash sitting around.</p>\n        <strong>Cash Equivalents vs Everything Else</strong>\n        <p>For cash equivalents like USDX that seek to be substitutes for stablecoins, I think this cost is worth paying. Stablecoins have shown clear market demand to be able to transact 24/7. Additionally, creating USDX as a new financial asset allowed us to create it in a way where it could be held by investors who don't have to directly onboard with the trading platform, specifically by making it a bearer asset. This allows USDX to function as a yield-bearing substitute for conventional stablecoins.</p>\n        <p>However, there is little demonstrated demand to be able to trade or settle 24/7 for most financial assets, and there is a material cost in recreating liquidity for tokenized assets that is largely duplicative with the liquidity for the assets that back them. We do not think that it would be advisable, for instance, to create a fund that invests in TSLA and then to tokenize ownership in that fund and then endeavor to create secondary market liquidity in those tokens with the help of arbitrageurs. We have a better solution.</p>\n        <p>Ultimately, for most financial assets other than cash equivalents, we believe that on-chain investors and application developers simply want a way to submit trade and settlement instructions via smart contracts to traditional market intermediaries (e.g., broker dealers, who can then submit instructions to exchanges). We are excited to unveil XFT Global Markets to help bring this solution to the on-chain economy.</p>\n        <strong>Introducing XFT Global Markets</strong>\n        <p>XFT Global Markets (\"XFT GM\") will provide native access to traditional securities and associated exchange liquidity for on-chain investors and protocol developers.</p>\n        <p>XFT GM is a platform that will include an introducing broker-dealer with accounts at traditional trading, clearing, and settlement venues that will, in addition to accepting client orders via API and web app, also accept orders via smart contract call and/or token transfer. Permissions for clients to be able to make those orders will be granted as blockchain tokens (analogous to API keys).</p>\n        <strong>Example Workflows</strong>\n        <p>Let us illustrate with an example to better understand how XFT GM will treat tokens. When a client purchases a security at XFT GM, she will be given a token. For instance, consider Alice, a client of XFT GM, who wishes to purchase TSLA (Tesla Inc) stock. Alice can fund her account with stablecoins or fiat and then instruct XFT GM—via smart contract call, API, or web app—to purchase TSLA. XFT GM will promptly purchase TSLA at Nasdaq and hold the shares in its broker-dealer's account (ultimately at the DTC). In return, Alice will receive TSLA tokens (xTSLA) with transfer restrictions that limit transfer to addresses associated with other XFT GM clients.</p>\n        <p>Alice could send her xTSLA tokens to someone else who is also a client of XFT GM, and XFT GM would observe that token transfer and treat it as authoritative settlement instructions to initiate an intra-broker-dealer transfer of shares (i.e. within the authoritative books and record of XFT GM's broker-dealer).</p>\n        <p>This practice of using the blockchain as a messaging system for otherwise centralized and regulated businesses is not dissimilar to how Silvergate and Signature treated blockchain messages on SEN and Signet, respectively, as authoritative instructions to initiate balance transfers between different users with accounts at the same bank. In the context of XFT GM, the assets that can be moved are public securities rather than bank deposit balances. Additionally, XFT GM will use tokens on public blockchain networks with transfer restrictions (whereas SEN and Signet were permissioned), and token holders will be able to use smart contracts for automation and other purposes.</p>\n        <p>As a practical example of how smart contracts could be used, imagine that Alice pledges her xTSLA as collateral in a smart contract that facilitates lending agreements. If Alice fails to repay a loan mediated by the smart contract, the contract could automatically trigger a burning of the xTSLA, which XFT GM would observe and treat as authoritative instructions to sell TSLA and remit stablecoin to the smart contract, allowing the lender to be repaid. This sale of TSLA would be treated no differently than one submitted via API or web app and would ultimately be routed to a conventional exchange (e.g. Nasdaq) then later cleared and settled on conventional infrastructure (e.g. NSCC, DTC).</p>\n        <p>Importantly, xTSLA would not represent a distinct financial asset with distinct liquidity needs from TSLA shares at XFT GM. Rather, xTSLA would represent rights to TSLA as held at XFT GM's broker-dealer and the ability to direct the broker-dealer to trade, settlement, or other instructions. We call this \"Directive Tokenization\".</p>\n        <strong>Example Use Cases</strong>\n        <p>The ability to execute buy, sell, and transfer orders in public securities using public market liquidity via smart contract calls and token transfers unlocks a new world of use cases and will represent a dramatic acceleration towards bridging the composability, transparency, and efficiency of public blockchains with the traditional financial system</p>\n        <p>As a couple of examples, consider:</p>\n        <ul>\n            <li>\n                <strong>Prime brokerage for crypto plus securities:</strong>\n                Prime brokerage includes the ability to get leverage on assets held by a variety of different custodians. This is generally inaccessible to retail users today, whose only option is margin leverage from a single brokerage who holds their securities. XFT GM would make it possible for third parties to provide lending arrangements that could easily collateralize loans by securities at a variety of different custodians. You can imagine similar financial products like derivatives (e.g. perps) cross-collateralized by crypto and securities held at different custodians.\n            </li>\n            <br><li>\n                <strong>Tokenized funds backed by token-powered securities:</strong>\n                If you are an asset manager creating funds – similar to USDX, or even an actively managed basket of securities – and you want to be able to accept subscription and redemption requests with stablecoins, we can make that easier for you. XFT GM can be funded directly with stablecoins, and redemption requests can be authoritatively requested via contract calls. This is the infrastructure we created to connect USDX to traditional brokerages that doesn't need to be re-created for every new fund manager with onchain investors.\n            </li>\n        </ul>\n        <strong>Comparisons</strong>\n        <p>XFT GM will combine the asset and liquidity access and institutional-grade investor protections of traditional brokerages with the on-chain interoperability, composability, and low-friction settlement of public blockchains. We highlight below the various facets of XFT GM's value proposition versus conventional brokerages and existing tokenized securities on public blockchains.</p>\n        <p><strong>XFT GM vs Traditional Brokerages (e.g., Goldman, Robinhood, Apex Clearing):</strong></p>\n        <ul>\n            <li>Compatibility with smart contracts (and thus on-chain lending, trading, derivative, etc. protocols)</li>\n            <li>Distribution and settlement on the same rails as crypto assets (appeals to crypto-native businesses like exchanges and users)</li>\n            <li>24/7 settlement when needed</li>\n        </ul>\n        <p><strong>XFT GM vs Existing Tokenized Securities:</strong></p>\n        <ul>\n            <li>Access to public securities and traditional liquidity venues (e.g., NYSE)</li>\n            <li>No requirement or cost to create new on-chain liquidity, custody, etc. for tokenized securities</li>\n            <li>Scales to thousands of liquid public securities</li>\n        </ul>\n        <p>To realize the promise of blockchains to create a fairer, open, and transparent financial system, it is paramount that we create infrastructure that is compatible and interoperable with both public blockchain networks and protocols as well as traditional trading, clearing, and settlement systems for regulated markets. We are creating XFT GM to achieve this mission and unlock access to and liquidity from public regulated securities for on-chain builders and investors.</p>",
    "date": "2024-02-25T00:56:34.472Z"
  }
]